Revit 2026 API

# MultiReferenceAnnotationOptionsElementsMatchReferenceCategory Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ElementsMatchReferenceCategory(
	ICollection<ElementId> elements
)
```
```vb
Public Function ElementsMatchReferenceCategory (
	elements As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
bool ElementsMatchReferenceCategory(
	ICollection<ElementId^>^ elements
)
```
```fsharp
member ElementsMatchReferenceCategory :
        elements : ICollection<ElementId> -> bool
```

#### Parameters

elements ICollectionElementId

#### Return Value

Boolean

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace